# ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024] # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768] # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512] # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512] # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]                   # 0-P1/2
  
  - [-1, 1, DWConv, [64, 3, 1, 1, False]]       # 1
  - [-1, 1, Conv, [128, 3, 2]]                  # 2 -P2/4 before 1
  - [-1, 2, GhostC3k2, [256, False, 0.25]]      # 3

  - [-4, 1, Focus, [128, 1, 1]]                 # 4 - 1/4
  - [[-1, -2], 1, Concat, [1]]                  #5 cat layers 5 and 5 dimen = 128, 1/4 

  - [-1, 1, DWConv, [128, 3, 1, 1, False]]      # 6
  - [-1, 1, Conv, [256, 3, 2]]                  # 7 -P3/8 ( before 3 small head o/p)
  - [-1, 2, GhostC3k2, [512, False, 0.25]]      # 8

  - [-3, 1, Focus, [256, 1, 1]]                 # 9 - 1/8
  - [[-1, -2], 1, Concat, [1]]                  # 10 cat layers  9 and 8 dimen = 128, 1/8 
  
  - [-1, 1, DWConv, [256, 3, 1, 1, False]]      # 11
  - [-1, 1, Conv, [512, 3, 2]]                  # 12 -P4/16 ( before 5 medium head o/p)
  - [-1, 2, GhostC3k2, [1024, True]]             #13 

  - [-3, 1, Focus, [512, 1, 1]]                 # 14 - 1/8
  - [[-1, -2], 1, Concat, [1]]                  # 15 cat layers  9 and 8 dimen = 128, 1/8 
  

  - [-1, 1, DWConv, [512, 3, 1, 1, False]]      # 16
  - [-1, 1, Conv, [1024, 3, 2]]                 # 17 -P5/32 ( before 7 large head o/p)
  - [-1, 2, GhostC3k2, [1024, True]]            # 18
  
  - [-1, 1, SPPF, [1024, 5]]                    # 19
  - [-1, 2, C2PSA, [1024]]                      # 20

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 21
  - [[-1, 13], 1, Concat, [1]] # 22 cat backbone P4 
  - [-1, 3, GhostC3k2, [512, False]] # 23 ( before 12)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #24
  - [[-1, 8], 1, Concat, [1]] # 25 cat backbone P3 ( before 14)
  - [-1, 3, GhostC3k2, [256, False]] # 26 (P3/8-small) ( before 15 small head o/p)

  - [-1, 1, Conv, [256, 3, 2]] #27
  - [[-1, 23], 1, Concat, [1]] # 28 cat head P4
  - [-1, 3, GhostC3k2, [512, False]] # 29 (P4/16-medium) ( before 18 Medium)

  - [-1, 1, Conv, [512, 3, 2]] #30
  - [[-1, 20], 1, Concat, [1]] #31 cat head P5
  - [-1, 3, GhostC3k2, [1024, True]] # 32 (P5/32-large) ( before 21 large head o/p)

  - [[26, 29, 32], 1, Detect, [nc]] # Detect(P3, P4, P5)
